# Introduction to Pandas

You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course

* Introduction to Pandas
    - Open source library built on top of Numpy
    - allows for fast analysis and data cleaning and preparation
    - built-in visualization feature
    - work with data from a wide variety of sources
* Installation
    - conda install pandas
    - pip install pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# 1. Series
The first main data type is the Series data type. 

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that:
    - a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location.
    - It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

## Creating a Series

convert a list,numpy array, or dictionary to a Series:
- pd.Series(data = , index = labels)
    - for dictionary, it takes key as index and value as data
    
## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).
- series[index OR labels]: get the corresponding value

## Operations
When add two series, it will match the label and add the value, when there is no match, put a NaN

# 2. DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. 

## Create a DataFrame
- df = pd.DataFrame(data, label): label [row][col]

## Selection Column
- df columns is just a series
- df.columns to check 
- df.col OR df['col name']
- df[['a list of col name']]: remember it's double brackets

## Select Row
- df rows are series
- df.index to check
- df.loc['row name']
    - df.loc['row name', 'col name'] or df.loc['row name']['col name']
    - df.loc[[list of row name], [list of col name]]
- df.iloc[numerical index]

## Create/Drop a New Column
- df['new'] = new data with consistent dimension
- df.drop('col name',axis=1, inplace = T/F)  => axis = 0, drop a row
    - inplace set to False then df would not change, inplace =True, the original df would drop
- del df['col1']: permantely delete a column 


## Conditional Selection
An important feature of pandas is conditional selection using bracket notation, similar to NumPy
- df[df condition]: returns the value that satisfy cond, other return NaN (only when you cond on whole df)
- df[df col/row cond]: will not get NaN value, and return conditional selection
- For two conditions you can use | and & with parenthesis
    - 'and' 'or' only works for single boolean value instead of series of boolean value

## More Index Details

more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!
- df.reset_index(): Reset to default 0,1...n index, can put inplace parameter
- df.set_index('col name'): Set this column as an df index, remember inplace arg

## Multi-Index and Index Hierarchy
- pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
- df.loc[outside index].loc[inside index]

## Cross Section
- df.xs(name, label): allows to grab cross section value from multi-index df

# 3. Missing Data

A few convenient methods to deal with Missing Data in pandas:
- df.dropna(): drop rows that have missing value
- df.dropna(axis=1): drop columns that have missing values
    - can put a threshold: drop row/col that has more than threshold missing value
- df.fillna(): fill in missing values, usually a mean value
    - df.fillna(value = 'fill value')
    - df.fillna(value = df['A'].mean())

# 4. Groupby

The groupby method allows you to group rows of data together and call aggregate functions
- byCol = df.groupby('col'): create an groupby object
- aggregate on group by object: byCol.mean()
- df.groupby.describe(): see details of many aggregate function

# 5. Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together.
- **pd.concat([df1, df2, df3], axis =0/1)**


## Merging
The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. 
- **pd.merge(left,right,how='inner',on='key')**

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.
- **df1.join(df2)**: default is inner join, you can put **df1.join(df2, how = "outer")**

# 6. Operations

## Unique Values
- **df['col2'].unique()**: present unique value (without dupilicates)
- **df['col2'].nunique()** : present number of unique values
- **df['col2'].value_counts()**: show counts of each unique value

## Apply Function
- **df['col'].apply(function)**
- **df['col'].apply(lambda x: x*2)**

## Sort and Order
- **df.sort_values('col2')**

## Pivot Table
- **df.pivot_table(values='not need', index = [], columns = [])**

# 7. Data Input and Output

Pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:
## Installation
**conda install sqlalchemy**
**conda install lxlml**
**conda install html5lib**
**conda install BeautifulSoup4**

**pwd** gives you the path


- CSV
    - read csv: df = pd.read_csv("file.csv")
    - write csv: df.to_csv('FileName', index = False)
- Excel: Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash. 
    - read excel: **pd.read_excel**('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)
    - write excel: **df.to_excel**('Excel_Sample2.xlsx', sheet_name = 'NewSheet')
- HTML:You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:
Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution). Pandas can read table tabs off of html.
    - read html: **df = pd.read_html('html link')**
 
 
- SQL: The **pandas.io.sql** module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are **psycopg2** for **PostgreSQL** or **pymysql** for MySQL. For SQLite this is included in Pythonâ€™s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


    If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

    See also some cookbook examples for some advanced strategies.

    The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

### Steps
1. from sqlalchemy import create_engine
2. engine = create_engine('sqlite:///:memory:')  : create an sqlite engine
3. df.to_sql('data', engine): write our df and connect to sql engine
4. sql_df = pd.read_sql('data',con=engine): read a sql database table through sqlite engine connection

In [121]:
#Multi Index
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

             A         B
G1 1  1.351807  0.257183
   2  0.126086  0.466044
   3 -0.135813 -0.710667
G2 1  0.863646 -0.726741
   2  0.417412  1.273269
   3 -1.194699 -0.145231

In [125]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=['Group', 'Num'])

In [124]:
df.xs(1, level= 'Num')

              A         B
Group
G1     1.351807  0.257183
G2     0.863646 -0.726741

In [17]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
#Convert to Series
labels = ['a','b', 'c']
my_data = [10, 20, 30] #list
arr = np.array(my_data) #np array
d = {'a':10, 'b':20, 'c':30} # dictionary

In [7]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [15]:
ser1 = pd.Series([1,2,3,4], ['Germany', 'USA', 'USSR', 'Japan'])
ser1['Germany']

1

In [20]:
#DATA FRAME
np.random.seed(101)

In [106]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'Y','X', 'Z'])
df

          W         Y         X         Z
A -0.141266  0.085529 -1.883809 -1.314142
B  2.601240 -0.612552 -1.714963  1.350046
C  1.798990 -1.312854  0.033590 -0.220208
D -0.308472 -0.842066 -0.831162 -0.493941
E  0.552794 -0.190511  0.231609  0.155412

In [40]:
df['new'] = df['W']+df['Z']
df

          W         Y         X         Z       new
A -0.298436  0.029141  0.889031 -1.839261 -2.137697
B  0.863596 -1.076591 -0.580383  1.209027  2.072623
C  1.201744 -0.820463 -1.029577 -1.524856 -0.323112
D -0.854860  1.602816  0.185479 -0.994018 -1.848878
E -0.131906 -1.335092 -0.089298  0.698566  0.566660

In [49]:
df.drop('new',axis=1, inplace = True)

In [55]:
df.loc['B', 'W']

-0.9286022737931389

In [56]:
df.loc[['B', 'C'], ['W', 'X']]

          W         X
B -0.928602 -0.468756
C  0.230087 -2.052563

In [66]:
df

          W         Y         X         Z
A -1.087436 -2.567767  0.661029 -0.332921
B -0.928602  1.715950 -0.468756  0.860097
C  0.230087  0.618658 -2.052563 -0.166646
D -0.445873  0.685874  2.785010  1.523750
E  1.290230 -1.478319  0.214234 -0.240510

In [78]:
df[df['Z']<0]['Y']

A   -2.567767
C    0.618658
E   -1.478319
Name: Y, dtype: float64

In [80]:
df[(df['W']>0) & (df['Y']<0)]

         W         Y         X        Z
E  1.29023 -1.478319  0.214234 -0.24051

In [81]:
df

          W         Y         X         Z
A -1.087436 -2.567767  0.661029 -0.332921
B -0.928602  1.715950 -0.468756  0.860097
C  0.230087  0.618658 -2.052563 -0.166646
D -0.445873  0.685874  2.785010  1.523750
E  1.290230 -1.478319  0.214234 -0.240510

In [85]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         Y         X         Z
0     A -1.087436 -2.567767  0.661029 -0.332921
1     B -0.928602  1.715950 -0.468756  0.860097
2     C  0.230087  0.618658 -2.052563 -0.166646
3     D -0.445873  0.685874  2.785010  1.523750
4     E  1.290230 -1.478319  0.214234 -0.240510

In [88]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [90]:
df['States'] = newind
df

          W         Y         X         Z States
A -1.087436 -2.567767  0.661029 -0.332921     CA
B -0.928602  1.715950 -0.468756  0.860097     NY
C  0.230087  0.618658 -2.052563 -0.166646     WY
D -0.445873  0.685874  2.785010  1.523750     OR
E  1.290230 -1.478319  0.214234 -0.240510     CO

In [91]:
df.set_index('States')

               W         Y         X         Z
States
CA     -1.087436 -2.567767  0.661029 -0.332921
NY     -0.928602  1.715950 -0.468756  0.860097
WY      0.230087  0.618658 -2.052563 -0.166646
OR     -0.445873  0.685874  2.785010  1.523750
CO      1.290230 -1.478319  0.214234 -0.240510

In [94]:
#Multi Index
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [96]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  1.407189  0.060971
   2 -1.542393 -0.821110
   3 -1.599171 -2.068836
G2 1  1.509747  0.174683
   2  0.463428 -2.206442
   3  0.544159  0.698296

In [117]:
df.xs('G1')

          A         B
1 -0.195703 -0.652119
2 -0.857696 -0.373495
3 -0.015975 -1.433131

In [126]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [128]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [131]:
bycomp = df.groupby('Company')
bycomp.mean()
bycomp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [2]:
import pandas as pd

In [139]:
cd /Users/apple/Documents/Python/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas

/Users/apple/Documents/Python/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas

In [25]:
df = pd.read_csv('example')

In [143]:
df.to_csv('My_Output, index=False')

In [26]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [147]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

In [24]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [14]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [22]:
from sqlalchemy import create_engine

In [19]:
engine = create_engine('sqlite:///:memory:')

In [27]:
## pass your table and connect to sql engine
df.to_sql('my_table', engine)

In [29]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15